package com.pratilipi.pratilipi;

import android.app.Activity;
import android.content.Context;
import android.content.SharedPreferences;
import android.os.Bundle;
import android.app.Fragment;
import android.support.v4.app.FragmentActivity;
import android.support.v4.view.MotionEventCompat;
import android.text.TextPaint;
import android.view.LayoutInflater;
import android.view.MotionEvent;
import android.view.View;
import android.view.ViewGroup;
import android.view.ViewTreeObserver;

import com.pratilipi.pratilipi.adapter.TextPagerAdapter;
import com.pratilipi.pratilipi.util.PageSplitter;
import com.pratilipi.pratilipi.util.CustomViewPager;

/**
 * A placeholder fragment containing a simple view.
 */
public class ReaderFragment extends Fragment {

    OnSwipeListener mCallback;
    float mStartDragX;

    // ReaderDrawerActivity must implement this interface
    public interface OnSwipeListener {
        public void onSwipeOut(boolean isEnd, String position);
        public void onTouch();
    }

    /**
     * The fragment argument representing the section number for this
     * fragment.
     */
    private static final String ARG_SECTION_NUMBER = "section_number";
    public float fontSize = 15;
    private CustomViewPager pagesView;
    private FragmentActivity myContext;
    /**
     * Returns a new instance of this fragment for the given section
     * number.
     */
    public static ReaderFragment newInstance(int sectionNumber, float fontSize) {
        ReaderFragment fragment = new ReaderFragment();
        Bundle args = new Bundle();
        args.putInt(ARG_SECTION_NUMBER, sectionNumber);
        fragment.setArguments(args);
        return fragment;
    }

    public ReaderFragment() {

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        Bundle args = getArguments();
        fontSize = args.getFloat("fontSize");
        View rootView = inflater.inflate(R.layout.fragment_reader_drawer, container, false);
        pagesView = (CustomViewPager) rootView.findViewById(R.id.pages);

        // to get ViewPager width and height we have to wait global layout
        pagesView.getViewTreeObserver().addOnGlobalLayoutListener(new ViewTreeObserver.OnGlobalLayoutListener() {
            @Override
            public void onGlobalLayout() {

                final PageSplitter pageSplitter;
                pageSplitter = new PageSplitter(pagesView.getWidth(), pagesView.getHeight(), 1, 0);

                TextPaint textPaint = new TextPaint();
                textPaint.setTextSize(fontSize);

                String lan = getActivity().getSharedPreferences("PREFERENCE", Context.MODE_PRIVATE).getString("selectedLanguage", "hi");

                if(lan.equalsIgnoreCase("hi"))
                    pageSplitter.append("हिन्दी के सर्वोत्तम साहित्यकारों में से एक, उपन्यास सम्राट मुंशी प्रेमचंद की अधिकतर कहानियाँ मानसरोवर में संग्रहीत हैं।\n" +
                        "\n" +
                        "मानसरोवर के इस चौथे भाग में अभिलाषा, भूत, सवा सेर गेहूँ, स्मृति का पुजारी  जैसी बेहतरीन कहानियाँ सम्मिलित हैं। \n" +
                        " \n" +
                        "भाग १: ईदगाह, पूस की रात, अलग्योझा, ठाकुर का कुंवा इत्यादि\n" +
                        "भाग २: दो बैलों की कथा, रियासत का दीवान, डामूल का कैदी, कानूनी कुमार इत्यादि\n" +
                        "भाग ३: शतरंज के खिलाड़ी, मुक्तिधन, सत्याग्रह, स्वर्ग की देवी इत्यादि\n" +
                        "भाग ५: कज़ाकी, पिसनहारी का कुंवा, प्रायश्चित, एक्ट्रेस इत्यादि\n" +
                        "भाग ६: यह मेरी मातृभूमि है, रानी सारन्धा, मर्यादा की वेदी, अमावास्या की रात्रि इत्यादि\n" +
                        "भाग ७: बड़े घर की बेटी, दुर्गा का मंदिर, दो भाई और जिहाद इत्यादि\n" +
                        "भाग ८: नमक का दारोगा, हार की जीत, बूढ़ी काकी, उपदेश इत्यादि" + "हिन्दी के सर्वोत्तम साहित्यकारों में से एक, उपन्यास सम्राट मुंशी प्रेमचंद की अधिकतर कहानियाँ मानसरोवर में संग्रहीत हैं।\n" +
                        "\n" +
                        "मानसरोवर के इस चौथे भाग में अभिलाषा, भूत, सवा सेर गेहूँ, स्मृति का पुजारी  जैसी बेहतरीन कहानियाँ सम्मिलित हैं। \n" +
                        " \n" +
                        "भाग १: ईदगाह, पूस की रात, अलग्योझा, ठाकुर का कुंवा इत्यादि\n" +
                        "भाग २: दो बैलों की कथा, रियासत का दीवान, डामूल का कैदी, कानूनी कुमार इत्यादि\n" +
                        "भाग ३: शतरंज के खिलाड़ी, मुक्तिधन, सत्याग्रह, स्वर्ग की देवी इत्यादि\n" +
                        "भाग ५: कज़ाकी, पिसनहारी का कुंवा, प्रायश्चित, एक्ट्रेस इत्यादि\n" +
                        "भाग ६: यह मेरी मातृभूमि है, रानी सारन्धा, मर्यादा की वेदी, अमावास्या की रात्रि इत्यादि\n" +
                        "भाग ७: बड़े घर की बेटी, दुर्गा का मंदिर, दो भाई और जिहाद इत्यादि\n" +
                        "भाग ८: नमक का दारोगा, हार की जीत, बूढ़ी काकी, उपदेश इत्यादि" + "हिन्दी के सर्वोत्तम साहित्यकारों में से एक, उपन्यास सम्राट मुंशी प्रेमचंद की अधिकतर कहानियाँ मानसरोवर में संग्रहीत हैं।\n" +
                        "\n" +
                        "मानसरोवर के इस चौथे भाग में अभिलाषा, भूत, सवा सेर गेहूँ, स्मृति का पुजारी  जैसी बेहतरीन कहानियाँ सम्मिलित हैं। \n" +
                        " \n" +
                        "भाग १: ईदगाह, पूस की रात, अलग्योझा, ठाकुर का कुंवा इत्यादि\n" +
                        "भाग २: दो बैलों की कथा, रियासत का दीवान, डामूल का कैदी, कानूनी कुमार इत्यादि\n" +
                        "भाग ३: शतरंज के खिलाड़ी, मुक्तिधन, सत्याग्रह, स्वर्ग की देवी इत्यादि\n" +
                        "भाग ५: कज़ाकी, पिसनहारी का कुंवा, प्रायश्चित, एक्ट्रेस इत्यादि\n" +
                        "भाग ६: यह मेरी मातृभूमि है, रानी सारन्धा, मर्यादा की वेदी, अमावास्या की रात्रि इत्यादि\n" +
                        "भाग ७: बड़े घर की बेटी, दुर्गा का मंदिर, दो भाई और जिहाद इत्यादि\n" +
                        "भाग ८: नमक का दारोगा, हार की जीत, बूढ़ी काकी, उपदेश इत्यादि" + "हिन्दी के सर्वोत्तम साहित्यकारों में से एक, उपन्यास सम्राट मुंशी प्रेमचंद की अधिकतर कहानियाँ मानसरोवर में संग्रहीत हैं।\n" +
                        "\n" +
                        "मानसरोवर के इस चौथे भाग में अभिलाषा, भूत, सवा सेर गेहूँ, स्मृति का पुजारी  जैसी बेहतरीन कहानियाँ सम्मिलित हैं। \n" +
                        " \n" +
                        "भाग १: ईदगाह, पूस की रात, अलग्योझा, ठाकुर का कुंवा इत्यादि\n" +
                        "भाग २: दो बैलों की कथा, रियासत का दीवान, डामूल का कैदी, कानूनी कुमार इत्यादि\n" +
                        "भाग ३: शतरंज के खिलाड़ी, मुक्तिधन, सत्याग्रह, स्वर्ग की देवी इत्यादि\n" +
                        "भाग ५: कज़ाकी, पिसनहारी का कुंवा, प्रायश्चित, एक्ट्रेस इत्यादि\n" +
                        "भाग ६: यह मेरी मातृभूमि है, रानी सारन्धा, मर्यादा की वेदी, अमावास्या की रात्रि इत्यादि\n" +
                        "भाग ७: बड़े घर की बेटी, दुर्गा का मंदिर, दो भाई और जिहाद इत्यादि\n" +
                        "भाग ८: नमक का दारोगा, हार की जीत, बूढ़ी काकी, उपदेश इत्यादि" + "हिन्दी के सर्वोत्तम साहित्यकारों में से एक, उपन्यास सम्राट मुंशी प्रेमचंद की अधिकतर कहानियाँ मानसरोवर में संग्रहीत हैं।\n" +
                        "\n" +
                        "मानसरोवर के इस चौथे भाग में अभिलाषा, भूत, सवा सेर गेहूँ, स्मृति का पुजारी  जैसी बेहतरीन कहानियाँ सम्मिलित हैं। \n" +
                        " \n" +
                        "भाग १: ईदगाह, पूस की रात, अलग्योझा, ठाकुर का कुंवा इत्यादि\n" +
                        "भाग २: दो बैलों की कथा, रियासत का दीवान, डामूल का कैदी, कानूनी कुमार इत्यादि\n" +
                        "भाग ३: शतरंज के खिलाड़ी, मुक्तिधन, सत्याग्रह, स्वर्ग की देवी इत्यादि\n" +
                        "भाग ५: कज़ाकी, पिसनहारी का कुंवा, प्रायश्चित, एक्ट्रेस इत्यादि\n" +
                        "भाग ६: यह मेरी मातृभूमि है, रानी सारन्धा, मर्यादा की वेदी, अमावास्या की रात्रि इत्यादि\n" +
                        "भाग ७: बड़े घर की बेटी, दुर्गा का मंदिर, दो भाई और जिहाद इत्यादि\n" +
                        "भाग ८: नमक का दारोगा, हार की जीत, बूढ़ी काकी, उपदेश इत्यादि", textPaint);
                else if(lan.equalsIgnoreCase("gu"))
                    pageSplitter.append("ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને  વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n " +
                            "ફિક્શન જયારે જનરલ બનીને દરેક પ્રસંગે આકાર લે ત્યારે એક લેખકની શૈલી સોળે કળાએ શૃંગાર સજી એમ કહેવાય. આવીજ  સુંદર મજાની અવનવી વાર્તાઓનું એક કલેક્શન એટલે લેખકશ્રી   લલિતભાઈનો  વાર્તા  સંગ્રહ.  આ સંગ્રહની દરેક વાર્તાની એક અલગ છટા  છે જે વાંચ્યે જ સાંપડે એમ છે. સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે. એશીના દાયકામાં વાચક વર્ગને આટલી સુંદર વાંચનની ભેટ આપવા બદલ અમે સહુ આપના  છીએ.\n "+
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને\n  વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ.\n " +
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને \n વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n" +
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને \n વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n" +
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને \n વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n" +
                            ""+"ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને  વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n " +
                            "ફિક્શન જયારે જનરલ બનીને દરેક પ્રસંગે આકાર લે ત્યારે એક લેખકની શૈલી સોળે કળાએ શૃંગાર સજી એમ કહેવાય. આવીજ  સુંદર મજાની અવનવી વાર્તાઓનું એક કલેક્શન એટલે લેખકશ્રી   લલિતભાઈનો  વાર્તા  સંગ્રહ.  આ સંગ્રહની દરેક વાર્તાની એક અલગ છટા  છે જે વાંચ્યે જ સાંપડે એમ છે. સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે. એશીના દાયકામાં વાચક વર્ગને આટલી સુંદર વાંચનની ભેટ આપવા બદલ અમે સહુ આપના  છીએ.\n "+
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને\n  વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ.\n " +
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને \n વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n" +
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને \n વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n" +
                            "ગોષ્ઠી એટલે જીવન જીવવાનું અમુલ્ય ભાથું. જેમાં તર્ક વિતર્ક પણ હોય અને સમાધાન પણ હોય. સાચી સૂઝ અને ગુરુ સાથેની દૈનિકની તાર્કિક ચર્ચાઓનો લાહવો જેને મળે એજ  આ ગોષ્ઠીનું મહાત્મ્ય સમજી શકે. અને જો આ ગોષ્ઠીમાં ધાર્મિક\n આદર્શો ભળે તો તેને સત્સંગ કર્યો કહેવાય . જેમાં જ્ઞાન  અને સમજણના અંગો આવે. એશીના દાયકામાં પહોચેલા સકારાત્મક અને આશાવાદી અભિગમ ધરાવતા લેખકશ્રીનો ગુજરાતી સાહિત્યને લઈને અનન્ય લગાવ એમના પુસ્તકોમાં ઝળકે છે.  પ્રતિલિપિના વાચક વર્ગને \n વાંચનની આ સુંદર  ભેટ આપવા બદલ અમે સહુ આપના આભારી  છીએ. \n" +
                            "", textPaint);
                else if(lan.equalsIgnoreCase("ta"))
                    pageSplitter.append("சென்னையில், ஒரு பிரபலமான அரசு பொறியியல் கல்லூரியில் பேராசிரியர் ஒருவர் கொடூரமான முறையில் கொல்லப்படுகிறார். இன்ஸ்பெக்டரான கதாநாயகன் விசாரணையில் ஈடுபடுகிறான். போலீசின் கவனம் முழுக்க கல்லூரியின் மீதிருக்க, கோயம்புத்தூரில் இன்னொரு கொலை நடக்கிறது. கொலைகாரன் வேண்டுமென்றே இன்ஸ்பெக்டருக்கு துப்பு கொடுத்துவிட்டு செல்ல, முதல் கொலை நடந்த கல்லூரியில், மாணவனொருவன் தற்கொலைக்கு முயல்கிறான். அவன்தான் முதல் கொலையின் விட்னெஸ். கல்லூரி நிர்வாகத்தால், தான் மனரீதியான சித்ரவதைக்கு ஆளானதால் தற்கொலைக்கு முயன்றதாக மாணவன் சொல்ல, இன்ஸ்பெக்டருக்கு உண்மைகள் புரியத் தொடங்குகின்றன. கல்லூரியில் ரகசிய விசாரணை மேற்கொள்கிறார். பொறியியல் கல்லூரிகளில் மாணவர்கள் எந்த அளவிற்கு கொடுமைபடுத்தப்படுகிறார்கள் என்பதை அறிந்து திடுக்கிடுகிறார். விசாரணையில், கல்லூரியின் முன்னாள் மாணவன்தான் கொலைகாரன் என்று தெரியவருகிறது. மனநிலை பாதிக்கப்பட்ட அவனை கைது செய்கிறார் இன்ஸ்பெக்டர். ஆனால் கொலைகள் தொடர்கின்றன. பின் ஏராளமான திருப்பங்கள் நிகழ்கின்றன. உண்மையான கொலைகாரன் யார்? தப்பு செய்தவர்கள் தண்டிக்கப் படுவார்களா? மிகப்பெரிய மனோதத்துவ விளையாட்டில் சிக்கிக்கொண்ட இன்ஸ்பெக்டர் பிழைப்பாரா?" +
                            "சென்னையில், ஒரு பிரபலமான அரசு பொறியியல் கல்லூரியில் பேராசிரியர் ஒருவர் கொடூரமான முறையில் கொல்லப்படுகிறார். இன்ஸ்பெக்டரான கதாநாயகன் விசாரணையில் ஈடுபடுகிறான். போலீசின் கவனம் முழுக்க கல்லூரியின் மீதிருக்க, கோயம்புத்தூரில் இன்னொரு கொலை நடக்கிறது. கொலைகாரன் வேண்டுமென்றே இன்ஸ்பெக்டருக்கு துப்பு கொடுத்துவிட்டு செல்ல, முதல் கொலை நடந்த கல்லூரியில், மாணவனொருவன் தற்கொலைக்கு முயல்கிறான். அவன்தான் முதல் கொலையின் விட்னெஸ். கல்லூரி நிர்வாகத்தால், தான் மனரீதியான சித்ரவதைக்கு ஆளானதால் தற்கொலைக்கு முயன்றதாக மாணவன் சொல்ல, இன்ஸ்பெக்டருக்கு உண்மைகள் புரியத் தொடங்குகின்றன. கல்லூரியில் ரகசிய விசாரணை மேற்கொள்கிறார். பொறியியல் கல்லூரிகளில் மாணவர்கள் எந்த அளவிற்கு கொடுமைபடுத்தப்படுகிறார்கள் என்பதை அறிந்து திடுக்கிடுகிறார். விசாரணையில், கல்லூரியின் முன்னாள் மாணவன்தான் கொலைகாரன் என்று தெரியவருகிறது. மனநிலை பாதிக்கப்பட்ட அவனை கைது செய்கிறார் இன்ஸ்பெக்டர். ஆனால் கொலைகள் தொடர்கின்றன. பின் ஏராளமான திருப்பங்கள் நிகழ்கின்றன. உண்மையான கொலைகாரன் யார்? தப்பு செய்தவர்கள் தண்டிக்கப் படுவார்களா? மிகப்பெரிய மனோதத்துவ விளையாட்டில் சிக்கிக்கொண்ட இன்ஸ்பெக்டர் பிழைப்பாரா?" +
                            "சென்னையில், ஒரு பிரபலமான அரசு பொறியியல் கல்லூரியில் பேராசிரியர் ஒருவர் கொடூரமான முறையில் கொல்லப்படுகிறார். இன்ஸ்பெக்டரான கதாநாயகன் விசாரணையில் ஈடுபடுகிறான். போலீசின் கவனம் முழுக்க கல்லூரியின் மீதிருக்க, கோயம்புத்தூரில் இன்னொரு கொலை நடக்கிறது. கொலைகாரன் வேண்டுமென்றே இன்ஸ்பெக்டருக்கு துப்பு கொடுத்துவிட்டு செல்ல, முதல் கொலை நடந்த கல்லூரியில், மாணவனொருவன் தற்கொலைக்கு முயல்கிறான். அவன்தான் முதல் கொலையின் விட்னெஸ். கல்லூரி நிர்வாகத்தால், தான் மனரீதியான சித்ரவதைக்கு ஆளானதால் தற்கொலைக்கு முயன்றதாக மாணவன் சொல்ல, இன்ஸ்பெக்டருக்கு உண்மைகள் புரியத் தொடங்குகின்றன. கல்லூரியில் ரகசிய விசாரணை மேற்கொள்கிறார். பொறியியல் கல்லூரிகளில் மாணவர்கள் எந்த அளவிற்கு கொடுமைபடுத்தப்படுகிறார்கள் என்பதை அறிந்து திடுக்கிடுகிறார். விசாரணையில், கல்லூரியின் முன்னாள் மாணவன்தான் கொலைகாரன் என்று தெரியவருகிறது. மனநிலை பாதிக்கப்பட்ட அவனை கைது செய்கிறார் இன்ஸ்பெக்டர். ஆனால் கொலைகள் தொடர்கின்றன. பின் ஏராளமான திருப்பங்கள் நிகழ்கின்றன. உண்மையான கொலைகாரன் யார்? தப்பு செய்தவர்கள் தண்டிக்கப் படுவார்களா? மிகப்பெரிய மனோதத்துவ விளையாட்டில் சிக்கிக்கொண்ட இன்ஸ்பெக்டர் பிழைப்பாரா?" +
                            "சென்னையில், ஒரு பிரபலமான அரசு பொறியியல் கல்லூரியில் பேராசிரியர் ஒருவர் கொடூரமான முறையில் கொல்லப்படுகிறார். இன்ஸ்பெக்டரான கதாநாயகன் விசாரணையில் ஈடுபடுகிறான். போலீசின் கவனம் முழுக்க கல்லூரியின் மீதிருக்க, கோயம்புத்தூரில் இன்னொரு கொலை நடக்கிறது. கொலைகாரன் வேண்டுமென்றே இன்ஸ்பெக்டருக்கு துப்பு கொடுத்துவிட்டு செல்ல, முதல் கொலை நடந்த கல்லூரியில், மாணவனொருவன் தற்கொலைக்கு முயல்கிறான். அவன்தான் முதல் கொலையின் விட்னெஸ். கல்லூரி நிர்வாகத்தால், தான் மனரீதியான சித்ரவதைக்கு ஆளானதால் தற்கொலைக்கு முயன்றதாக மாணவன் சொல்ல, இன்ஸ்பெக்டருக்கு உண்மைகள் புரியத் தொடங்குகின்றன. கல்லூரியில் ரகசிய விசாரணை மேற்கொள்கிறார். பொறியியல் கல்லூரிகளில் மாணவர்கள் எந்த அளவிற்கு கொடுமைபடுத்தப்படுகிறார்கள் என்பதை அறிந்து திடுக்கிடுகிறார். விசாரணையில், கல்லூரியின் முன்னாள் மாணவன்தான் கொலைகாரன் என்று தெரியவருகிறது. மனநிலை பாதிக்கப்பட்ட அவனை கைது செய்கிறார் இன்ஸ்பெக்டர். ஆனால் கொலைகள் தொடர்கின்றன. பின் ஏராளமான திருப்பங்கள் நிகழ்கின்றன. உண்மையான கொலைகாரன் யார்? தப்பு செய்தவர்கள் தண்டிக்கப் படுவார்களா? மிகப்பெரிய மனோதத்துவ விளையாட்டில் சிக்கிக்கொண்ட இன்ஸ்பெக்டர் பிழைப்பாரா?" +
                            "சென்னையில், ஒரு பிரபலமான அரசு பொறியியல் கல்லூரியில் பேராசிரியர் ஒருவர் கொடூரமான முறையில் கொல்லப்படுகிறார். இன்ஸ்பெக்டரான கதாநாயகன் விசாரணையில் ஈடுபடுகிறான். போலீசின் கவனம் முழுக்க கல்லூரியின் மீதிருக்க, கோயம்புத்தூரில் இன்னொரு கொலை நடக்கிறது. கொலைகாரன் வேண்டுமென்றே இன்ஸ்பெக்டருக்கு துப்பு கொடுத்துவிட்டு செல்ல, முதல் கொலை நடந்த கல்லூரியில், மாணவனொருவன் தற்கொலைக்கு முயல்கிறான். அவன்தான் முதல் கொலையின் விட்னெஸ். கல்லூரி நிர்வாகத்தால், தான் மனரீதியான சித்ரவதைக்கு ஆளானதால் தற்கொலைக்கு முயன்றதாக மாணவன் சொல்ல, இன்ஸ்பெக்டருக்கு உண்மைகள் புரியத் தொடங்குகின்றன. கல்லூரியில் ரகசிய விசாரணை மேற்கொள்கிறார். பொறியியல் கல்லூரிகளில் மாணவர்கள் எந்த அளவிற்கு கொடுமைபடுத்தப்படுகிறார்கள் என்பதை அறிந்து திடுக்கிடுகிறார். விசாரணையில், கல்லூரியின் முன்னாள் மாணவன்தான் கொலைகாரன் என்று தெரியவருகிறது. மனநிலை பாதிக்கப்பட்ட அவனை கைது செய்கிறார் இன்ஸ்பெக்டர். ஆனால் கொலைகள் தொடர்கின்றன. பின் ஏராளமான திருப்பங்கள் நிகழ்கின்றன. உண்மையான கொலைகாரன் யார்? தப்பு செய்தவர்கள் தண்டிக்கப் படுவார்களா? மிகப்பெரிய மனோதத்துவ விளையாட்டில் சிக்கிக்கொண்ட இன்ஸ்பெக்டர் பிழைப்பாரா?" +
                            "சென்னையில், ஒரு பிரபலமான அரசு பொறியியல் கல்லூரியில் பேராசிரியர் ஒருவர் கொடூரமான முறையில் கொல்லப்படுகிறார். இன்ஸ்பெக்டரான கதாநாயகன் விசாரணையில் ஈடுபடுகிறான். போலீசின் கவனம் முழுக்க கல்லூரியின் மீதிருக்க, கோயம்புத்தூரில் இன்னொரு கொலை நடக்கிறது. கொலைகாரன் வேண்டுமென்றே இன்ஸ்பெக்டருக்கு துப்பு கொடுத்துவிட்டு செல்ல, முதல் கொலை நடந்த கல்லூரியில், மாணவனொருவன் தற்கொலைக்கு முயல்கிறான். அவன்தான் முதல் கொலையின் விட்னெஸ். கல்லூரி நிர்வாகத்தால், தான் மனரீதியான சித்ரவதைக்கு ஆளானதால் தற்கொலைக்கு முயன்றதாக மாணவன் சொல்ல, இன்ஸ்பெக்டருக்கு உண்மைகள் புரியத் தொடங்குகின்றன. கல்லூரியில் ரகசிய விசாரணை மேற்கொள்கிறார். பொறியியல் கல்லூரிகளில் மாணவர்கள் எந்த அளவிற்கு கொடுமைபடுத்தப்படுகிறார்கள் என்பதை அறிந்து திடுக்கிடுகிறார். விசாரணையில், கல்லூரியின் முன்னாள் மாணவன்தான் கொலைகாரன் என்று தெரியவருகிறது. மனநிலை பாதிக்கப்பட்ட அவனை கைது செய்கிறார் இன்ஸ்பெக்டர். ஆனால் கொலைகள் தொடர்கின்றன. பின் ஏராளமான திருப்பங்கள் நிகழ்கின்றன. உண்மையான கொலைகாரன் யார்? தப்பு செய்தவர்கள் தண்டிக்கப் படுவார்களா? மிகப்பெரிய மனோதத்துவ விளையாட்டில் சிக்கிக்கொண்ட இன்ஸ்பெக்டர் பிழைப்பாரா?" +
                            "", textPaint);
                pagesView.setAdapter(new TextPagerAdapter(myContext.getSupportFragmentManager(), pageSplitter.getPages(),fontSize));
                pagesView.getViewTreeObserver().removeOnGlobalLayoutListener(this);
                pagesView.setOnTouchListener(new View.OnTouchListener() {
                    @Override
                    public boolean onTouch(View v, MotionEvent ev) {
                            final int action = ev.getAction();
                            float x = ev.getX();
                            switch(action & MotionEventCompat.ACTION_MASK){
                                case MotionEvent.ACTION_DOWN:
                                    mStartDragX = x;
                                    break;
                                case MotionEvent.ACTION_MOVE:
                                    break;
                                case MotionEvent.ACTION_UP:
                                    if (x==mStartDragX){
                                        mCallback.onTouch();
                                    }else{
                                        mStartDragX = 0;
                                    }
                                    break;
                            }
                        return false;
                    }
                });
                pagesView.setOnSwipeOutListener(new CustomViewPager.OnSwipeOutListener() {
                    @Override
                    public void onSwipeOutAtStart() {
                        mCallback.onSwipeOut(false,ARG_SECTION_NUMBER);
                    }

                    @Override
                    public void onSwipeOutAtEnd() {
                        mCallback.onSwipeOut(true,ARG_SECTION_NUMBER);
                    }
                });
            }
        });

        return rootView;

    }

    @Override
    public void onAttach(Activity activity) {
        myContext=(FragmentActivity) activity;
        super.onAttach(activity);

        // This makes sure that the Read activity has implemented
        // the callback interface. If not, it throws an exception
        try {
            mCallback = (OnSwipeListener) activity;
        } catch (ClassCastException e) {
            throw new ClassCastException(activity.toString()
                    + " must implement OnSwipeOutListener");
        }
    }
}
